# St7GetNumGeometryFaceVertices

Returns the number of vertices in a given geometry face.

long St7GetNumGeometryFaceVertices(long uID, long FaceNum, long* NumVertices)

Input Parameters

uID

Strand7 model file ID.

FaceNum

Face number.

Output Parameters
NumVertices

Number of vertices in the specified face.